package it.sevenbits.trex.game.controller.lib;

/**
 * Базовый интерфейс для всех сцен в игре.
 * Владеет экземпляром этого класса SceneManager.
 * SceneManager НЕ отвечает за создание сцен.
 * SceneManager ОТВЕЧАЕТ за удаление сцен из памяти.
 *
 * Сцена создается ОДИН раз на всё приложение.
 */
public interface IScene {
    /**
     * Эта функция запускается один раз, когда произошел переход на эту сцену.
     * В следующий раз эта функция запустится при очередном переходе на эту сцену.
     */
    void onCreate();

    /**
     * Эта функция запускается на каждый тик игрового цикла.
     */
    void onRender();

    /**
     * Эта функция запускается один раз при переходе с этой сцены на какую-то другую.
     * В следующий раз эта функция запустится при очередном переходе на эту сцену.
     */
    void onExit();
}
